server/load-test/orders.yml
# server/load-test/orders.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: Warm up
    - duration: 300
      arrivalRate: 50
      rampTo: 200
      name: Stress test
  processor: "./auth-hook.js"

scenarios:
  - name: "Order Lifecycle"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "test123"
          capture:
            json: "$.token"
            as: "authToken"
            
      - get:
          url: "/api/products"
          capture:
            json: "$.products[0]._id"
            as: "productId"

      - post:
          url: "/api/cart"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            productId: "{{ productId }}"
            quantity: 1

      - post:
          url: "/api/orders"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            shippingAddress:
              street: "123 Test St"
              city: "Testville"
              state: "TS"
              zipCode: "12345"